# Introducci√≥n a Pandas

Plan: 
* Data frames
* Series
* Index
* Accessing elements
* Element-wise operations
* Filtering
* String operations
* Summarizing operations
* Missing operations
* Grouping
* Getting the Numpy arrays

In [1]:
import pandas as pd
import numpy as np

## Data frames

Let's create some data (similar to car price data from Chapter 2).

El data frame se puede creae con una lista de lista

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [4]:
df_temp = pd.DataFrame(data)
df_temp

         0         1     2      3  4          5            6      7
0   Nissan    Stanza  1991  138.0  4     MANUAL        sedan   2000
1  Hyundai    Sonata  2017    NaN  4  AUTOMATIC        Sedan  27150
2    Lotus     Elise  2010  218.0  4     MANUAL  convertible  54990
3      GMC    Acadia  2017  194.0  4  AUTOMATIC      4dr SUV  34450
4   Nissan  Frontier  2017  261.0  6     MANUAL       Pickup  32340

In [5]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

Alternatively, we can use a list of dictionaries to create a dataframe:

Otra forma con un diccionario

In [6]:
data = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    {
        "Make": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "MSRP": 54990
    },
    {
        "Make": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "MSRP": 34450
    },
    {
        "Make": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        "MSRP": 32340
    }
]

In [7]:
df = pd.DataFrame(data)

In [8]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [9]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [10]:
df.tail(n=3)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

## Series

Columns in a data frame - series. To access it, use dot or brackets

In [11]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [12]:
df['Make']

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

If a name contains spaces, we can't use dot, only brackets

In [13]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [14]:
col_name = 'Engine HP'
df[col_name]

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

Use a list to select a subset of columns

In [15]:
df[['Make', 'Model', 'MSRP']]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

Adding, changing and removing columns

In [16]:
df['id'] = ['nis1', 'hyu1', 'lot2', 'gmc1', 'nis2']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,nis1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,hyu1
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,lot2
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,gmc1
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,nis2

In [17]:
df['id'] = [1, 2, 3, 4, 5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [18]:
del df['id']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

## Index

In [33]:
df.index =['a','b','c','d','e'] # cambia la indexacion del data frame

In [31]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [21]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [22]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

# Accessing elements

Accessing rows and shuffling

In [35]:
df.loc['b'] # obtener la fila 2 por el numero del indice

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
Name: b, dtype: object

In [36]:
df.loc[['a','b']] # obtener la fila 1 y 2 por el nombre de los indices a y b

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [38]:
df.iloc[0] # escoge la fila 1

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: a, dtype: object

In [40]:
df.iloc[[2, 3, 0]] # escoge la fila 3,,4 y 0  sin importar el indice

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [42]:
df.reset_index() # resetea el indice y pone el indice como columna

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [43]:
df.reset_index(drop =True) # resetea el indice y no lo pone como columna

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

Pero aun asi el data frame no cambia, para cambiarlo debemos poner el mismo nombre

In [45]:
df =  df.reset_index(drop =True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [48]:
idx = np.arange(5)
idx

array([0, 1, 2, 3, 4])

In [49]:
np.random.seed(2)
np.random.shuffle(idx)
idx

array([2, 4, 1, 3, 0])

In [50]:
df.iloc[idx]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [51]:
df = df.iloc[idx]

In [52]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [53]:
df.iloc[[0, 1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [54]:
df.index

Int64Index([2, 4, 1, 3, 0], dtype='int64')

In [55]:
df.loc[[0, 1]] # escoge las filas por la indexacion

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [57]:
df.iloc[[0, 1]] # escoge las filas del data frame

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [58]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [59]:
df.reset_index(drop=True)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

Splitting data (Dividir los datos)

In [62]:
n_train = 3
n_val = 1
n_test = 1

In [65]:
df_train = df.iloc[:n_train]
df_val = df.iloc[n_train:n_train+n_val]
df_test = df.iloc[n_train+n_val:]

In [64]:
df_train

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [66]:
df_val

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

In [67]:
df_test

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [68]:
df[['Make', 'Model', 'Year']]

      Make     Model  Year
2    Lotus     Elise  2010
4   Nissan  Frontier  2017
1  Hyundai    Sonata  2017
3      GMC    Acadia  2017
0   Nissan    Stanza  1991

In [69]:
df_train[['Make', 'Model', 'Year']]

      Make     Model  Year
2    Lotus     Elise  2010
4   Nissan  Frontier  2017
1  Hyundai    Sonata  2017

In [70]:
df_val[['Make', 'Model', 'Year']]

  Make   Model  Year
3  GMC  Acadia  2017

In [71]:
df_test[['Make', 'Model', 'Year']]

     Make   Model  Year
0  Nissan  Stanza  1991

In [72]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [73]:
df.reset_index(drop=True)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [74]:
df = df.reset_index(drop=True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

## Element-wise operations

In [75]:
df['Engine HP']

0    218.0
1    261.0
2      NaN
3    194.0
4    138.0
Name: Engine HP, dtype: float64

In [80]:
df['Engine HP'] / 100

0    2.18
1    2.61
2     NaN
3    1.94
4    1.38
Name: Engine HP, dtype: float64

In [77]:
df['Year']

0    2010
1    2017
2    2017
3    2017
4    1991
Name: Year, dtype: int64

In [81]:
df['Year'] > 2000

0     True
1     True
2     True
3     True
4    False
Name: Year, dtype: bool

In [83]:
df['Year'] >= 2015

0    False
1     True
2     True
3     True
4    False
Name: Year, dtype: bool

We can combine multiple expressions with "and" or "or"

In [86]:
df['Make'] == 'Nissan'

0    False
1     True
2    False
3    False
4     True
Name: Make, dtype: bool

In [85]:
(df['Year'] > 2000) & (df['Make'] == 'Nissan')

0    False
1     True
2    False
3    False
4    False
dtype: bool

## Filtering

In [87]:
df[df['Make'] == 'Nissan']

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [88]:
df[(df['Year'] > 2010) & (df['Transmission Type'] == 'AUTOMATIC')]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

## String operations

In [90]:
'STRr'.lower()

'strr'

In [91]:
df['Vehicle_Style']

0    convertible
1         Pickup
2          Sedan
3        4dr SUV
4          sedan
Name: Vehicle_Style, dtype: object

In [92]:
df['Vehicle_Style'].str.lower() # coloca las letras en minusculas

0    convertible
1         pickup
2          sedan
3        4dr suv
4          sedan
Name: Vehicle_Style, dtype: object

In [93]:
df['Vehicle_Style'].str.replace(' ', '_') # reemplaza el espacio por guion al piso

0    convertible
1         Pickup
2          Sedan
3        4dr_SUV
4          sedan
Name: Vehicle_Style, dtype: object

In [94]:
df['Vehicle_Style'].str.lower().str.replace(' ', '_') #coloca las letras en minusculas y reemplaza el espacio por guion al piso

0    convertible
1         pickup
2          sedan
3        4dr_suv
4          sedan
Name: Vehicle_Style, dtype: object

In [98]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.lower().str.replace(' ', '_')

In [99]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [95]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [96]:
df.columns.str.lower().str.replace(' ', '_')

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp'],
      dtype='object')

In [55]:
df.columns = df.columns.str.lower().str.replace(' ', '_')

In [56]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [104]:
df.dtypes

Make                  object
Model                 object
Year                   int64
Engine HP            float64
Engine Cylinders       int64
Transmission Type     object
Vehicle_Style         object
MSRP                   int64
dtype: object

In [105]:
df.dtypes.index

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [106]:
df.dtypes == 'object'

Make                  True
Model                 True
Year                 False
Engine HP            False
Engine Cylinders     False
Transmission Type     True
Vehicle_Style         True
MSRP                 False
dtype: bool

In [107]:
df.dtypes[df.dtypes == 'object']

Make                 object
Model                object
Transmission Type    object
Vehicle_Style        object
dtype: object

In [108]:
df.dtypes[df.dtypes == 'object'].index

Index(['Make', 'Model', 'Transmission Type', 'Vehicle_Style'], dtype='object')

In [109]:
list(df.dtypes[df.dtypes == 'object'].index)

['Make', 'Model', 'Transmission Type', 'Vehicle_Style']

In [110]:
string_columns = df.dtypes[df.dtypes == 'object'].index

for col in string_columns:
    df[col] = df[col].str.lower().str.replace(' ', '_')

In [120]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.0,4,manual,convertible,54990
1,nissan,frontier,2017,261.0,6,manual,pickup,32340
2,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.0,4,manual,sedan,2000

## Summarizing operations (EDA)

Numerical columns

In [115]:
df.MSRP

0    54990
1    32340
2    27150
3    34450
4     2000
Name: MSRP, dtype: int64

In [114]:
df.MSRP.max()

54990

In [66]:
df.MSRP.mean()

30186.0

In [67]:
df.MSRP.sum()

150930

In [116]:
df.MSRP.min(), df.MSRP.max(), df.MSRP.mean(), df.MSRP.std()

(2000, 54990, 30186.0, 18985.044903818372)

In [118]:
df.MSRP.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [121]:
df.mean()

C:\Users\Usuario\AppData\Local\Temp/ipykernel_26456/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Year                 2010.40
Engine HP             202.75
Engine Cylinders        4.40
MSRP                30186.00
dtype: float64

In [123]:
df.describe().round(2) # hace el resumen estadistico de las variables numericas

          Year  Engine HP  Engine Cylinders      MSRP
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

Categorical columns

In [126]:
df.Make

0      lotus
1     nissan
2    hyundai
3        gmc
4     nissan
Name: Make, dtype: object

In [127]:
df.Make.nunique() # te dice las categorias sin repetirlas

4

In [128]:
df.nunique()

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
MSRP                 5
dtype: int64

In [129]:
df.Make.value_counts() # te obtiene la frecuencia absoluta o te hace el conteo

nissan     2
lotus      1
hyundai    1
gmc        1
Name: Make, dtype: int64

## Missing values

In [130]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.0,4,manual,convertible,54990
1,nissan,frontier,2017,261.0,6,manual,pickup,32340
2,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.0,4,manual,sedan,2000

In [131]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [134]:
df.isnull().sum() # te suma los nan

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

In [138]:
df['Engine HP'].isnull()

0    False
1    False
2     True
3    False
4    False
Name: Engine HP, dtype: bool

In [140]:
df['Engine HP'].fillna(0) # en la fila donde esta el nan asigna el valor de cero

0    218.0
1    261.0
2      0.0
3    194.0
4    138.0
Name: Engine HP, dtype: float64

In [142]:
df['Engine HP'].fillna(df['Engine HP'].mean()) # a la fila le asigna el valor del promedio

0    218.00
1    261.00
2    202.75
3    194.00
4    138.00
Name: Engine HP, dtype: float64

In [143]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.0,4,manual,convertible,54990
1,nissan,frontier,2017,261.0,6,manual,pickup,32340
2,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.0,4,manual,sedan,2000

In [146]:
df['Engine HP'] = df['Engine HP'].fillna(df['Engine HP'].mean())
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.00,4,manual,convertible,54990
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

## Sorting and re-ordering

In [147]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.00,4,manual,convertible,54990
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

In [150]:
df.sort_values(by='MSRP') # ordena por la columna MSRP el data frame de menor a mayor

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
4,nissan,stanza,1991,138.00,4,manual,sedan,2000
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
0,lotus,elise,2010,218.00,4,manual,convertible,54990

In [151]:
df.sort_values(by='MSRP', ascending=False) # ordena por la columna MSRP el data frame de mayor a menor

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

## Grouping

    SELECT
        Transmission Type,
        AVG(MSRP)
    FROM
        cars
    GROUP BY
        Transmission Type

df.groupby('Transmission Type').MSRP.mean()

In [153]:
df.groupby('Transmission Type').MSRP.mean()

Transmission Type
automatic    30800.000000
manual       29776.666667
Name: MSRP, dtype: float64

    SELECT
        Transmission Type,
        AVG(MSRP),
        COUNT(MSRP)
    FROM
        cars
    GROUP BY
        Transmission Type

In [154]:
df_group = df.groupby('Transmission Type').MSRP.agg(['mean', 'count'])
df_group

                           mean  count
Transmission Type
automatic          30800.000000      2
manual             29776.666667      3

In [155]:
df.MSRP.mean()

30186.0

In [156]:
df_group['mean'] - df.MSRP.mean()

Transmission Type
automatic    614.000000
manual      -409.333333
Name: mean, dtype: float64

## Getting the NumPy array

In [157]:
df.MSRP

0    54990
1    32340
2    27150
3    34450
4     2000
Name: MSRP, dtype: int64

In [160]:
np.log1p(df.MSRP)

0    10.914925
1    10.384091
2    10.209169
3    10.447293
4     7.601402
Name: MSRP, dtype: float64

In [161]:
df.MSRP.values

array([54990, 32340, 27150, 34450,  2000], dtype=int64)

In [162]:
np.log1p(df.MSRP.values)

array([10.91492481, 10.38409105, 10.20916916, 10.4472933 ,  7.60140233])

## Convert to dicts

In [165]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,lotus,elise,2010,218.00,4,manual,convertible,54990
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

In [166]:
df.to_dict(orient='records')

[{'Make': 'lotus',
  'Model': 'elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'manual',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990},
 {'Make': 'nissan',
  'Model': 'frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'manual',
  'Vehicle_Style': 'pickup',
  'MSRP': 32340},
 {'Make': 'hyundai',
  'Model': 'sonata',
  'Year': 2017,
  'Engine HP': 202.75,
  'Engine Cylinders': 4,
  'Transmission Type': 'automatic',
  'Vehicle_Style': 'sedan',
  'MSRP': 27150},
 {'Make': 'gmc',
  'Model': 'acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'automatic',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450},
 {'Make': 'nissan',
  'Model': 'stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'manual',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000}]

In [167]:
df.to_dict(orient='rows')

C:\Users\Usuario\AppData\Local\Temp/ipykernel_26456/3478964939.py:1: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  df.to_dict(orient='rows')

[{'Make': 'lotus',
  'Model': 'elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'manual',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990},
 {'Make': 'nissan',
  'Model': 'frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'manual',
  'Vehicle_Style': 'pickup',
  'MSRP': 32340},
 {'Make': 'hyundai',
  'Model': 'sonata',
  'Year': 2017,
  'Engine HP': 202.75,
  'Engine Cylinders': 4,
  'Transmission Type': 'automatic',
  'Vehicle_Style': 'sedan',
  'MSRP': 27150},
 {'Make': 'gmc',
  'Model': 'acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'automatic',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450},
 {'Make': 'nissan',
  'Model': 'stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'manual',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000}]